Revit 2027 API
FilteredWorksetCollector Constructor
 Constructs a new FilteredWorksetCollector that will search and filter the set of worksets in a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredWorksetCollector(
	Document document
)
Public Sub New (
	document As Document
)
public:
FilteredWorksetCollector(
	Document^ document
)
new :
        document : Document -> FilteredWorksetCollector
Parameters
document Document
 The document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace